//算术运算符
//作用：用于处理四则运算
//
//算术运算符包括以下符号：
//运算符	术语			示例			结果
//  +		正号			+ 3				3
//  -		负号			- 3				- 3
//  +		加				10 + 5			15
//  -		减				10 - 5			5
//  *		乘				10 * 5			50
//  /		除				10 / 5			2
//  %		取模(取余)		10 % 3			1
// ++		前置递增	a = 2; b = ++a;		a = 3; b = 3;
// ++		后置递增	a = 2; b = a++;		a = 3; b = 2;
// --		前置递减	a = 2; b = --a;		a = 1; b = 1;
// --		后置递减	a = 2; b = a--;		a = 1; b = 2;


#include<iostream>
using namespace std;

int main()
{
	int a1 = 10;
	int b1 = 25;
	cout << a1 % b1 << endl;

	//两个小数不可以取模,只有整型变量可以进行取模运算
	double d1 = 3.14;
	double d2 = 1.1;
	cout << d1 % d2 << endl;

	system("pause");

	return 0;

}