//算术运算符
//作用：用于处理四则运算
//
//算术运算符包括以下符号：
//运算符	术语			示例			结果
//  +		正号			+ 3				3
//  -		负号			- 3				- 3
//  +		加				10 + 5			15
//  -		减				10 - 5			5
//  *		乘				10 * 5			50
//  /		除				10 / 5			2
//  %		取模(取余)		10 % 3			1
// ++		前置递增	a = 2; b = ++a;		a = 3; b = 3;
// ++		后置递增	a = 2; b = a++;		a = 3; b = 2;
// --		前置递减	a = 2; b = --a;		a = 1; b = 1;
// --		后置递减	a = 2; b = a--;		a = 1; b = 2;


#include<iostream>
using namespace std;

int main()
{
	//前置递增
	int a1 = 10;
	++a1;	//a = a + 1
	cout << "a1= " << a1 << endl;

	//后置递增
	int a2 = 15;
	a2++;
	cout << "a2= " << a2 << endl;

	//区别
	//前置递增 先对变量进行++，再进行计算表达式
	int a3 = 15;
	int b3 = ++a3 * 8;
	cout << "a3= " << a3 << endl;
	cout << "b3= " << b3 << endl;

	//后置递增 先进行计算表达式，再对变量进行++
	int a4 = 18;
	int b4 = a4++ * 6;
	cout << "a4= " << a4 << endl;
	cout << "b4= " << b4 << endl;

	system("pause");

	return 0;

}